Repository: HEROEngineer/healthcheck
Catalog: locale/*/LC_MESSAGES/django.po
Languages: it

source: Docs
it: Documentazione

source: Sign In
it: Accedi

source: Cron Monitoring. Monitor nightly backups, weekly reports, cron jobs and background tasks. Receive alerts when your tasks don't run on time.
it: Sistema di Monitoraggio. Controllo backup notturni, report settimanali, cron job e attività in background. Ricevi avvisi quando le tue attività non vengono eseguite in tempo.

source: Monitoring for your nightly backups, weekly reports, cron jobs and background tasks.
it: Sistema di Monitoraggio di servizi, processi, backup notturni, cron job e attività in background. Invio di avvisi quando le attività non vengono eseguite in tempo.

source: Make HTTP requests to the Ping URL at regular intervals.
it: Invia una richiesta HTTP presso l'URL di controllo (Ping URL) ad un intervallo regolare.

source: When the URL is not pinged on time, %(site_name)s will send you an alert.
it: Quando l'URL non viene pingato per tempo %(site_name)s ti invierà un alert.

source: You can monitor any service that can make HTTP requests or send emails.
it: Puoi monitorare qualsiasi tipo di servizio inviando una richiesta http periodica, o una email.

source: For each of your periodic tasks, %(site_name)s provides an unique URL similar to this one:
it: Per ogni task periodico, %(site_name)s provvederà un URL unico simile a questo:

source: As an alternative to HTTP requests, you can also report "liveness" by <strong>sending email messages</strong>.
it: Come alternativa alle richieste HTTP possiamo anche usare <strong>l'invio di email</strong>.

source: You can instruct %(site_name)s to look for a particular keyword in the subject line. This is handy when your backup software sends an email after every run, and uses a different subject line depending on success or failure.
it: Puoi istruire %(site_name)s per controllare la presenza di una parola particolare. Questo è vantaggioso quando un software di backup invia una email di notifica usando parole differenti nell'oggetto della email, in base allo stato di esecuzione.

source: %(site_name)s monitors the heartbeat messages sent by your cron jobs, services and APIs. Get immediate alerts when they don't arrive on schedule.
it: %(site_name)s controlla i messaggi di "heathbeat" inviati dalle tue procedure schedulate, dai tuoi servizi e dalle tue APIs. Riceverai avvisi immediati quando quello che stai controllando non dovesse più risultare funzionante.

source: Sign Up – It's Free
it: Registrati - E' gratuito

source: A quick peek of what's inside:
it: Un rapido sguardo:

source: Live-updating Dashboard
it: Dashboard che si auto aggiorna

source: A list of your checks, one for each Cron job, daemon or scheduled task you want to monitor.
it: Una lista di controlli, una per ogni risorsa registrata, servizio o processo schedulato che desideri monitorare.

source: Give names and assign tags to your checks to easily recognize them later.
it: Rinomina e aggiungi tag ai tuoi controlli periodici, così che tu possa individuarli meglio in seguito.

source: Tap on the integration icons to toggle them on and off.
it: Clicca sulle icone di integrazione per escludere momentaneamente alcuni recapiti.

source: Adjust Period and Grace time to match the periodicity and duration of your tasks.
it: Configura un periodo di attesa (Period) e un periodo di Grazia (Grace) corrispondenti alla durata dei tuoi processi.

source: Simple Configuration
it: Configurazione Semplice

source: Each check has configurable <strong>Period</strong> and <strong>Grace Time</strong> parameters. Depending on these parameters and time since the last ping, the check is in one of the following states:
it: Ogni controllo ha i parametri <strong>Period</strong> e <strong>Grace Time</strong>. In base a questi e a partire dall'ultimo ping ricevuto, il controllo può assumere uno dei seguenti stati:

source: New. A check that has been created, but has not received any pings yet.
it: New. Un controllo che è stato creato, ma non ha ancora ricevuto alcun ping.

source: Up. Time since last ping has not exceeded <strong>Period</strong>.
it: UP. Il tempo da quando l'ultim ping non ha superato l'intervallo definito come <strong>Period</strong>.

source: Late. Time since last ping has exceeded <strong>Period</strong>, but has not yet exceeded <strong>Period</strong> + <strong>Grace</strong>.
it: Late. Da quando l'ultimo ping ha superato la soglia definita in <strong>Period</strong> ma non <strong>Period</strong> + <strong>Grace</strong>.

source: Down. Time since last ping has exceeded <strong>Period</strong> + <strong>Grace</strong>. When check goes from "Late" to "Down", %(site_name)s sends you a notification.
it: Down. Il tempo da quanto l'ultimo ping ha superato l'intervallo di <strong>Period</strong> + <strong>Grace</strong>. Quando lo stato va da "Late" a "Down", %(site_name)s invierà una notifica.

source: Cron Expression Support
it: Supporto alle espressioni Cron

source: Alternatively, you can define the expected ping dates and times using a cron expression. See
it: In alternativa, è possibile definire le date e gli orari del ping previsti utilizzando un'espressione cron. Vedere

source: for the supported syntax features.
it: per le sintassi supportate.

source: <strong>Grace Time</strong> specifies how "late" a ping can be before you will be alerted. Set it to be a little above the expected duration of your cron job.
it: <strong>Grace Time</strong> specifica di quanto possa ritardare un ping prima di essere ritenuto fallito. Impostalo in modo che sia leggermente superiore alla durata prevista della tua procedura.

source: Details and Event Log
it: Dettagli e log eventi

source: You can add a longer, free-form description to each check. Leave notes and pointers for yourself and for your team.
it: È possibile aggiungere una descrizione più lunga e in formato libero a ciascun controllo. Lascia note e suggerimenti per te e per la tua squadra.

source: You can also see the log of received pings and sent "Down" notifications.
it: Puoi anche vedere il registro dei ping ricevuti e le notifiche "Down" inviate.

source: Public Status Badges
it: Badges pubblici

source: %(site_name)s provides status badges for each of the tags you have used. Additionally, the "%(site_name)s" badge shows the overall status of all checks in your account.
it: %(site_name)s fornisce badge di stato per ciascuno dei tag che hai usato. Inoltre i badge mostrano lo stato generale di tutti i controlli che te configurati.

source: The badges have public, but hard-to-guess URLs. You can use them in your READMEs, dashboards or status pages.
it: I badge hanno URL pubblici, ma difficili da indovinare. Puoi usarli nei tuoi README, dashboard, pagine di stato, scheda dei servizi.

source: Integrations
it: Integrazioni

source: Set up multiple ways to get notified:
it: Seleziona sistemi di notifica differenti:

source: Push Notifications
it: Invia notifiche

source: Incident Management
it: Gestione degli Incidenti

source: Event Monitoring
it: Controllo degli eventi

source: Shell Commands
it: Comandi Shell

source: Project Management
it: Gestione del Progetto

source: What Can I Monitor With %(site_name)s?
it: Cosa posso monitorare con %(site_name)s?

source: %(site_name)s monitoring is a great fit for cron jobs and cron-like systems (systemd timers, Jenkins build jobs, Windows Scheduled Tasks, wp-cron, uwsgi cron-like interface, Heroku Scheduler, ...). A failed cron job often has no immediate visible consequences, and can go unnoticed for a long time.
it: %(site_name)s si adatta perfettamente a lavori cron e sistemi simil-cron (timer di sistema, lavori di compilazione di Jenkins, operazioni pianificate di Windows, wp-cron, interfaccia simil-uwsgi-cron, Heroku Scheduler, ...). Un cron job fallito spesso non ha conseguenze visibili immediate e può passare inosservato per molto tempo.

source: Specific examples:
it: Esempi specifici:

source: Processes, Services, Servers
it: Processi, Servizi, Sistemi

source: %(site_name)s monitoring can be used for lightweight server monitoring: ensuring a particular system service, or the server as a whole is alive and healthy. Write a shell script that checks for a specific condition, and pings %(site_name)s if successful. Run the shell script regularly.
it: %(site_name)s può essere utilizzato per un controllo agile: garantisce per un particolare servizio di sistema o che il server nel suo insieme sia vivo ed integro. Scrivi uno script di shell che verifica una condizione specifica e avvia un ping periodico.

source: Check a specific docker container is running
it: Controlla che una macchina virtuale o un container sia correttamente in esecuzione

source: Check a specific application process is running
it: Controlla che una applicazione sia correttamente in esecuzione

source: Check database replication lag
it: Controlla le latenze di replica delle basi dati

source: Check system resources: free disk, free RAM, ...
it: Controlla le risorse di sistema: spazio disco, ram disponibile ...

source: Send simple, unconditional "I'm alive" messages from your server (or your NAS, router, Raspberry Pi, ...)
it: Invia messaggi "I am alive" semplici e incondizionati dal tuo server (o dal tuo NAS, router, Raspberry Pi

source: %(site_name)s is a <strong>free</strong> and <a href="https://github.com/healthchecks/healthchecks">open source</a> service. Setting up monitoring for your cron jobs only takes minutes. Start sleeping better at nights!
it: %(site_name)s è un progetto <strong>Libero</strong> e <a href="https://github.com/healthchecks/healthchecks">OpenSource</a>. L'impostazione del monitoraggio per i tuoi lavori cron richiederà solo pochi minuti.

source: Sign Up
it: Accedi
